## Basic Data Identification and Manupulation

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [6]:
df.head(n = 7)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN
5         0       3    male   NaN      0      0   8.4583        Q  NaN
6         0       1    male  54.0      0      0  51.8625        S    E

In [7]:
df.tail(n = 7)

     survived  pclass     sex   age  sibsp  parch    fare embarked deck
884         0       3    male  25.0      0      0   7.050        S  NaN
885         0       3  female  39.0      0      5  29.125        Q  NaN
886         0       2    male  27.0      0      0  13.000        S  NaN
887         1       1  female  19.0      0      0  30.000        S    B
888         0       3  female   NaN      1      2  23.450        S  NaN
889         1       1    male  26.0      0      0  30.000        C    C
890         0       3    male  32.0      0      0   7.750        Q  NaN

To display Max rows and columns, we use:<br><br>
pd.options.display.max_rows = 100<br>
pd.options.display.max_columns = 100

In [8]:
# To get all Column values, we use 
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

In [10]:
# To get Range of Index (Row) variables, we use 
df.index

RangeIndex(start=0, stop=891, step=1)

In [11]:
# To get metadata Information, use
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
survived    891 non-null int64
pclass      891 non-null int64
sex         891 non-null object
age         714 non-null float64
sibsp       891 non-null int64
parch       891 non-null int64
fare        891 non-null float64
embarked    889 non-null object
deck        203 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.7+ KB

In [12]:
# To check the n*m matrix shape of a dataframe, use
df.shape

(891, 9)

In [13]:
# To show summary statistics for all Numerical Data, we use
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [14]:
# To check the file type of the tabulation/Input, use
type(df)

pandas.core.frame.DataFrame

In [15]:
# Checking the Row/Length of the Dataframe
len(df)

891

In [17]:
# To round off all float objects in a dataframe by 2 digits, we use 
round(df, 2).head()

   survived  pclass     sex   age  sibsp  parch   fare embarked deck
0         0       3    male  22.0      1      0   7.25        S  NaN
1         1       1  female  38.0      1      0  71.28        C    C
2         1       3  female  26.0      0      0   7.92        S  NaN
3         1       1  female  35.0      1      0  53.10        S    C
4         0       3    male  35.0      0      0   8.05        S  NaN

In [19]:
# To round off all float objects in a dataframe, we use 
round(df, 0).head()

   survived  pclass     sex   age  sibsp  parch  fare embarked deck
0         0       3    male  22.0      1      0   7.0        S  NaN
1         1       1  female  38.0      1      0  71.0        C    C
2         1       3  female  26.0      0      0   8.0        S  NaN
3         1       1  female  35.0      1      0  53.0        S    C
4         0       3    male  35.0      0      0   8.0        S  NaN

## Dataframe Attributes & Methods

In [21]:
# To return the amount of all elements in a Dataframe: 891*9, we use
df.size

8019

In [23]:
# Show Minimum value for each column
df.min()

survived         0
pclass           1
sex         female
age           0.42
sibsp            0
parch            0
fare             0
dtype: object

Female comes First because 'F' comes before 'M' in Alphabet. It doesnt represent the occurances of Females or Males

Use Shift+tab(4 times) to bring a Detailed description of the method

In [25]:
# Sort values in Descending order for Age Column
df.sort_values(by = 'age', ascending= False).head(n = 6)

     survived  pclass   sex   age  sibsp  parch     fare embarked deck
630         1       1  male  80.0      0      0  30.0000        S    A
851         0       3  male  74.0      0      0   7.7750        S  NaN
493         0       1  male  71.0      0      0  49.5042        C  NaN
96          0       1  male  71.0      0      0  34.6542        C    A
116         0       3  male  70.5      0      0   7.7500        Q  NaN
672         0       2  male  70.0      0      0  10.5000        S  NaN

## Selecting seperate columns

In [26]:
# Show only age column
df['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [27]:
# To see the data-type of age column
type(df['age'])

pandas.core.series.Series

In [29]:
# To make the age column as data frame, we use
df[['age']].head(n=10)

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0
5   NaN
6  54.0
7   2.0
8  27.0
9  14.0

In [31]:
# Checking the type of the column
print(type(df[['age']]))

<class 'pandas.core.frame.DataFrame'>

In [33]:
# To Select Age, Sex and Fare (Multiple Columns) from the dataframe, do
df[["age", "fare", "sex"]].head()

    age     fare     sex
0  22.0   7.2500    male
1  38.0  71.2833  female
2  26.0   7.9250  female
3  35.0  53.1000  female
4  35.0   8.0500    male

In [35]:
# Validating whether a column from one dataframe equals other
df.age.equals(df["age"])

True

### Selecting Rows with [[ ]] - Not Advisable

In [36]:
df.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN

In [38]:
# Slicing First Row
df[0:1]

   survived  pclass   sex   age  sibsp  parch  fare embarked deck
0         0       3  male  22.0      1      0  7.25        S  NaN

In [39]:
# Slicing Last 5 Rows
df[-5:]

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [43]:
# Index operators with iloc function
df.iloc[0]

survived       0
pclass         3
sex         male
age           22
sibsp          1
parch          0
fare        7.25
embarked       S
deck         NaN
Name: 0, dtype: object

In [41]:
# To check the Data Type
type(df.iloc[0])

pandas.core.series.Series

In [44]:
# To get Last 5 Rows
df.iloc[-5:]

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [45]:
# To Select only particular rows - 5,114, 87,578,890 from the data frame
df.iloc[['5','114','87','578','890']]

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
5           0       3    male   NaN      0      0   8.4583        Q  NaN
114         0       3  female  17.0      0      0  14.4583        C  NaN
87          0       3    male   NaN      0      0   8.0500        S  NaN
578         0       3  female   NaN      1      0  14.4583        C  NaN
890         0       3    male  32.0      0      0   7.7500        Q  NaN

In [48]:
# Display df
df.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN

In [50]:
# Slicing Rows and Columns - dataframe.index_location['Row','Column']
df.iloc[0,2]

'male'

In [53]:
# Slicing Rows and Columns - dataframe.index_location['Row','Column']
df.iloc[1,3:6]

age      38
sibsp     1
parch     0
Name: 1, dtype: object

In [55]:
# Select 2,4,6,1 columns from 3- [2]nd index
df.iloc[2,[2,4,6,1]]

sex       female
sibsp          0
fare       7.925
pclass         3
Name: 2, dtype: object

In [56]:
# To select Multiple Rows and Columns, we can use
df.iloc[32:38, 1:6]

    pclass     sex   age  sibsp  parch
32       3  female   NaN      0      0
33       2    male  66.0      0      0
34       1    male  28.0      1      0
35       1    male  42.0      1      0
36       3    male   NaN      0      0
37       3    male  21.0      0      0

In [57]:
# To select Specific Rows and Columns, we can use
df.iloc[[32, 38, 112, 249, 192, 700], [1,3,6,8]]

     pclass   age      fare deck
32        3   NaN    7.7500  NaN
38        3  18.0   18.0000  NaN
112       3  22.0    8.0500  NaN
249       2  54.0   26.0000  NaN
192       3  19.0    7.8542  NaN
700       1  18.0  227.5250    C

In [59]:
# To Select first 4 columns with all rows | Contained using head method
df.iloc[:,:5].head()

   survived  pclass     sex   age  sibsp
0         0       3    male  22.0      1
1         1       1  female  38.0      1
2         1       3  female  26.0      0
3         1       1  female  35.0      1
4         0       3    male  35.0      0

In [60]:
# To validate, we can use
df.iloc[:,1].equals(df.pclass)

True

## Loc based Indexing
#### To select Rows and Columns using labels we use .loc method : It selects the Index <br>
df.loc["PHELPS, Michael"] <br>

Select first Row from Michael Phelps column, we can use <br>
df.loc["PHELPS, Michael"].iloc[0]

In [64]:
# Here we use 'Summer.csv' for Loc Reference with athlete as index column
summer = pd.read_csv('summer.csv', index_col='Athlete')

In [65]:
summer.head(5)

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [67]:
# Select Rows containing Michael Phelps
summer.loc["PHELPS, Michael"].head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,100M Butterfly,Gold
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,200M Butterfly,Gold
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,200M Freestyle,Bronze
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,200M Individual Medley,Gold
"PHELPS, Michael",2004,Athens,Aquatics,Swimming,USA,Men,400M Individual Medley,Gold

In [69]:
# Select first Row of Michael Phelps
summer.loc["PHELPS, Michael"].iloc[0]

Year                    2004
City                  Athens
Sport               Aquatics
Discipline          Swimming
Country                  USA
Gender                   Men
Event         100M Butterfly
Medal                   Gold
Name: PHELPS, Michael, dtype: object

In [70]:
# To select only the Medal column in Phelps row, we use
summer.loc["PHELPS, Michael", "Medal"]

Athlete
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael    Bronze
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael    Bronze
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael      Gold
PHELPS, Michael    Silver
PHELPS, Michael      Gold
PHELPS, Michael    Silver
PHELPS, Michael      Gold
PHELPS, Michael      Gold
Name: Medal, dtype: object

In [75]:
# To Get Multiple Columns for a Particular Row, we use
summer.loc["PHELPS, Michael", ["Medal", 'Event']].head()

                  Medal                   Event
Athlete
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael    Gold          200M Butterfly
PHELPS, Michael  Bronze          200M Freestyle
PHELPS, Michael    Gold  200M Individual Medley
PHELPS, Michael    Gold  400M Individual Medley

In [78]:
# To Get Multiple Columns for a Particular Carl Lewis and Michael Phelps, we use
summer.loc[["PHELPS, Michael", "LEWIS, Carl"], ["Medal", 'Event']]

                  Medal                   Event
Athlete
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael    Gold          200M Butterfly
PHELPS, Michael  Bronze          200M Freestyle
PHELPS, Michael    Gold  200M Individual Medley
PHELPS, Michael    Gold  400M Individual Medley
PHELPS, Michael  Bronze  4X100M Freestyle Relay
PHELPS, Michael    Gold     4X100M Medley Relay
PHELPS, Michael    Gold  4X200M Freestyle Relay
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael    Gold          200M Butterfly
PHELPS, Michael    Gold          200M Freestyle
PHELPS, Michael    Gold  200M Individual Medley
PHELPS, Michael    Gold  400M Individual Medley
PHELPS, Michael    Gold  4X100M Freestyle Relay
PHELPS, Michael    Gold     4X100M Medley Relay
PHELPS, Michael    Gold  4X200M Freestyle Relay
PHELPS, Michael    Gold          100M Butterfly
PHELPS, Michael  Silver          200M Butterfly
PHELPS, Michael    Gold             200M Medley
PHELPS, Michael  Silver        4X100M Freestyle
PHELPS, Michael    Gold           4X100M Medley
PHELPS, Michael    Gold        4X200M Freestyle
LEWIS, Carl        Gold                    100M
LEWIS, Carl        Gold                    200M
LEWIS, Carl        Gold            4X100M Relay
LEWIS, Carl        Gold               Long Jump
LEWIS, Carl        Gold                    100M
LEWIS, Carl      Silver                    200M
LEWIS, Carl        Gold               Long Jump
LEWIS, Carl        Gold            4X100M Relay
LEWIS, Carl        Gold               Long Jump
LEWIS, Carl        Gold               Long Jump

In [79]:
# head of Dataframe
summer.head(10)

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Bronze
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,1200M Freestyle,Gold
"ANDREOU, Joannis",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,400M Freestyle,Bronze
"NEUMANN, Paul",1896,Athens,Aquatics,Swimming,AUT,Men,400M Freestyle,Gold

In [85]:
# Slice till CHASAPIS, Spiridon -> You can use it only for Unique Values : Label based slicing only works for unique values
summer.loc[:"CHASAPIS, Spiridon"]

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [86]:
# Label Based slicing for multiple unique labels can be performed using
summer.loc["DRIVAS, Dimitrios":"NEUMANN, Paul"]

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Bronze
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,1200M Freestyle,Gold
"ANDREOU, Joannis",1896,Athens,Aquatics,Swimming,GRE,Men,1200M Freestyle,Silver
"CHOROPHAS, Efstathios",1896,Athens,Aquatics,Swimming,GRE,Men,400M Freestyle,Bronze
"NEUMANN, Paul",1896,Athens,Aquatics,Swimming,AUT,Men,400M Freestyle,Gold

In [88]:
# Label Based slicing for DRIVAS, Dimitrios for Year and Country can be performed using
summer.loc["DRIVAS, Dimitrios", ["Year", "Country"]]

Year       1896
Country     GRE
Name: DRIVAS, Dimitrios, dtype: object

In [92]:
# We can Rearrange our Operations (Also Chain Indexing) using
summer[["Year", "Sport", "Event"]].loc["LEWIS, Carl"]

             Year      Sport         Event
Athlete
LEWIS, Carl  1984  Athletics          100M
LEWIS, Carl  1984  Athletics          200M
LEWIS, Carl  1984  Athletics  4X100M Relay
LEWIS, Carl  1984  Athletics     Long Jump
LEWIS, Carl  1988  Athletics          100M
LEWIS, Carl  1988  Athletics          200M
LEWIS, Carl  1988  Athletics     Long Jump
LEWIS, Carl  1992  Athletics  4X100M Relay
LEWIS, Carl  1992  Athletics     Long Jump
LEWIS, Carl  1996  Athletics     Long Jump

In [94]:
# You can Chain two Indexing Operations using
summer.loc["LEWIS, Carl"][["Year", "Sport", "Event"]]

             Year      Sport         Event
Athlete
LEWIS, Carl  1984  Athletics          100M
LEWIS, Carl  1984  Athletics          200M
LEWIS, Carl  1984  Athletics  4X100M Relay
LEWIS, Carl  1984  Athletics     Long Jump
LEWIS, Carl  1988  Athletics          100M
LEWIS, Carl  1988  Athletics          200M
LEWIS, Carl  1988  Athletics     Long Jump
LEWIS, Carl  1992  Athletics  4X100M Relay
LEWIS, Carl  1992  Athletics     Long Jump
LEWIS, Carl  1996  Athletics     Long Jump

In [95]:
# The Bettewr way to perform it is using One Indexing Operation
summer.loc["LEWIS, Carl", ["Year", "Sport", "Event"]]

             Year      Sport         Event
Athlete
LEWIS, Carl  1984  Athletics          100M
LEWIS, Carl  1984  Athletics          200M
LEWIS, Carl  1984  Athletics  4X100M Relay
LEWIS, Carl  1984  Athletics     Long Jump
LEWIS, Carl  1988  Athletics          100M
LEWIS, Carl  1988  Athletics          200M
LEWIS, Carl  1988  Athletics     Long Jump
LEWIS, Carl  1992  Athletics  4X100M Relay
LEWIS, Carl  1992  Athletics     Long Jump
LEWIS, Carl  1996  Athletics     Long Jump

# To be Continued'